/**
 * 設定関連
 */


/**
 * グリッドのサイズ
 */
export const TILE_MAP_SIZE = 10;

/**
 * タイルの幅
 */
export const TILE_WIDTH = 100;
export const TILE_HEIGHT = TILE_WIDTH/2;

/**
 * タイルの開始地点
 */

 export const TILE_START_Y = 150;
 

/**
 * タイルマップ 読み込むタイル画像の番号を設定
 */
export const TILE_MAP = [
  [1,20,3,4,5,6,20,8,9,10,],
  [1,2,3,4,5,6,7,8,9,10,],
  [1,2,3,4,5,6,7,8,9,10,],
  [1,2,3,4,5,6,7,8,9,10,],
  [1,2,3,4,5,6,7,8,9,10,],
  [1,2,3,4,5,6,7,8,9,10,],
  [1,2,3,4,5,6,7,8,9,10,],
  [1,2,3,4,5,6,7,8,9,10,],
  [1,2,3,4,5,6,7,8,9,10,],
  [1,2,3,4,5,6,20,8,9,36,],
]

/**
 * スプライトにしたタイルを保持
 */
export const TILES = [
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
  [],
];
